modm-ext/archive-stmicro-svd/header_stm32h725aei6.svd
        <register>
          <name>CR5</name>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CR5</name>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR5</name>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR5</name>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR5</name>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR5</name>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR5</name>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR5</name>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR5</name>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR5</name>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR5</name>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR5</name>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CR6</name>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CR6</name>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR6</name>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR6</name>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR6</name>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR6</name>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR6</name>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR6</name>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR6</name>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR6</name>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR6</name>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR6</name>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CR7</name>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CR7</name>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR7</name>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR7</name>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR7</name>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR7</name>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR7</name>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR7</name>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR7</name>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR7</name>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR7</name>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR7</name>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAMUX1</name>
      <baseAddress>0x40020800</baseAddress>
      <registers>
        <register>
          <name>CCR0</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR0</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR1</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR1</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR2</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR2</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR3</name>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR3</name>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR4</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR4</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR5</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR5</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR6</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR6</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR7</name>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR7</name>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR8</name>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR9</name>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR0</name>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR1</name>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR2</name>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR3</name>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR4</name>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR5</name>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCRs</name>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCRs</name>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR0</name>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR0</name>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR1</name>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR1</name>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR2</name>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR2</name>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR3</name>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR3</name>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR4</name>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR4</name>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR5</name>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR5</name>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR6</name>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR6</name>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR7</name>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCR7</name>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCRs</name>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CCRs</name>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
        </register>
